using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
/*
                           _ooOoo_
                          o8888888o
                          88" . "88
                          (| -_- |)
                          O\  =  /O
                       ____/`---'\____
                     .'  \\|     |//  `.
                    /  \\|||  :  |||//  \
                   /  _||||| -:- |||||-  \
                   |   | \\\  -  /// |   |
                   | \_|  ''\---/''  |   |
                   \  .-\__  `-`  ___/-. /
                 ___`. .'  /--.--\  `. . __
              ."" '<  `.___\_<|>_/___.'  >'"".
             | | :  `- \`.;`\ _ /`;.`/ - ` : | |
             \  \ `-.   \_ __\ /__ _/   .-` /  /
        ======`-.____`-.___\_____/___.-`____.-'======
                           `=---='
        ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
                 佛祖保佑       永无BUG
        *********************************************
        * 作者：冯际成
        * 单位：青海盐湖工业股份有限公司信息中心
        * 电话：15209793953
 */
namespace Qhyhgf.WeiXin.Qy.Api.Domain
{
    /// <summary>
    /// 多媒体类型
    /// </summary>
    public enum MediaType
    {
        /// <summary>
        /// 图片
        /// 2MB，支持JPG,PNG格式
        /// </summary>
        Image = 1 << 0,
        /// <summary>
        /// 语音
        /// 2MB，播放长度不超过60s，仅支持AMR格式
        /// </summary>
        Voice = 1 << 1,
        /// <summary>
        /// 视频
        /// 10MB，支持MP4格式
        /// </summary>
        Video = 1 << 2,
        /// <summary>
        /// 普通文件
        /// 20MB
        /// </summary>
        File = 1 << 3
    }
}
